Tekla Open API Reference for Tekla Structures 2025
ProfileCatalog Properties
The ProfileCatalog type exposes the following members.
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedProfile
 The selected profile in the control.
Top
See Also
Reference
ProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace